# noinspection SpellCheckingInspection
class Config:
    COM_PORT = 'COM3'
    BAUD_RATE = 9600
    BOT_TOKEN = ''
    START_TEXT = 'Скажите какой-либо цвет, например: красный или синий'
    DETECTED_TEXT = 'Распознанный текст цвета:\n`{}`'
    TEMPORARY_FILE = 'temporary.ogg'
    AUDIO_FILE = 'audio.wav'
    LANGUAGE = 'ru-RU'
    COLORS = {
        'чёрный': (0, 0, 0),
        'белый': (128, 128, 128),
        'красный': (255, 0, 0),
        'жёлтый': (180, 255, 0),
        'зелёный': (0, 255, 0),
        'синий': (0, 0, 255),
        'оранжевый': (220, 255, 0),
        'фиолетовый': (128, 0, 128),
        'розовый': (255, 192, 203),
        'голубой': (40, 80, 255),
        'бирюзовый': (0, 255, 255),
        'коричневый': (165, 42, 42),
    }
